#### 【 Pandas 초급 시험 】

**지시사항**
- 각 문항의 지시에 따라 코드를 작성하고, 지정된 변수명에 결과를 담으세요.
- 필요한 패키지: pandas, numpy (기본 제공)

In [1]:
## 모듈 로딩 
import pandas as pd
import numpy as np

<hr> 1. DataFrame 기초 생성 및 속성 이해 <hr>

- 1-1: people_basic에서 DataFrame 그대로 `q1_1`에 저장하세요.
- 1-2: 컬럼명 리스트를 `q1_2_cols`, 인덱스 RangeIndex의 시작/끝을 튜플 `q1_2_index_info`로.
- 1-3: 행 수를 `q1_3_rows`, 열 수를 `q1_3_cols`에.
- 1-4: 나이 평균과 중앙값을 튜플 `(mean, median)`로 `q1_4_stats`에.
- 1-5: 나이가 30 이상인 행만 `q1_5_df`에.

In [ ]:
# === [1] DataFrame 기초 생성 및 속성 이해 ===
# 아래 변수들에 결과를 담으세요.
# 1-1
q1_1 = pd.read_csv('../EXAM_DATA/people_basic.csv')
display(q1_1)
# 1-2
q1_2_cols = q1_1.columns.tolist
print(q1_2_cols)

q1_2_index_info = q1_1.index[:]
print(q1_2_index_info)

# 1-3
q1_3_rows = q1_1.index[-1] + 1
print(q1_3_rows)

q1_3_cols = 3 
print(q1_3_cols) 

# 1-4
q1_4_stats = (q1_1['age'].mean() , q1_1['age'].median())
print(q1_4_stats)

# 1-5
q1_5_df = q1_1[q1_1['age']>=30]
print(q1_5_df)

   name  age     city
0   Kim   25    Seoul
1   Lee   32    Busan
2  Park   41    Daegu
3  Choi   19  Incheon
4  Jung   28  Daejeon

<bound method IndexOpsMixin.tolist of Index(['name', 'age', 'city'], dtype='object')>
RangeIndex(start=0, stop=5, step=1)
5
3
(np.float64(29.0), np.float64(28.0))
   name  age   city
1   Lee   32  Busan
2  Park   41  Daegu

<hr> 2. 데이터 입출력 및 컬럼/인덱스 조작 (students 사용) <hr>

- 2-1: students를 `q2_1_df`에 (이미 로드된 것을 사용).
- 2-2: 상위 5개 행을 `q2_2_head`에.
- 2-3: 컬럼명을 ['이름','국어','영어','수학']으로 변경한 DataFrame을 `q2_3_renamed`에.
- 2-4: 인덱스를 '이름'으로 설정한 DataFrame을 `q2_4_indexed`에.
- 2-5: 다시 인덱스를 초기화한 DataFrame을 `q2_5_reset`에.

In [ ]:
# === [2] 데이터 입출력 및 컬럼/인덱스 조작 ===
DATA_FILE = '../EXAM_DATA/students.csv'

# 2-1
q2_1_df = pd.read_csv(DATA_FILE)
print(q2_1_df)

# 2-2
q2_2_head = q2_1_df.head(5)
print(q2_2_head)

# 2-3
# q2_3_renamed = q2_1_df.rename_axis(['이름','국어','영어','수학'], axis=1)
# print(q2_3_renamed)

# 2-4
q2_4_indexed = q2_1_df.set_index('name') ## 이름 설정이 안 돼서 name으로 대체
print(q2_4_indexed)

# 2-5
q2_5_reset = q2_1_df.reset_index(drop=True)
print(q2_5_reset)

   name  kor  eng  math
0   Kim   90   88    91
1   Lee   80   79    83
2  Park   75   82    80
3  Choi   95   90    92
4  Jung   85   84    88
5   Han   70   69    72
6  Yoon   88   85    87
7   Lim   92   91    95
8   Son   77   73    78
9    Jo   83   87    85
   name  kor  eng  math
0   Kim   90   88    91
1   Lee   80   79    83
2  Park   75   82    80
3  Choi   95   90    92
4  Jung   85   84    88
      kor  eng  math
name
Kim    90   88    91
Lee    80   79    83
Park   75   82    80
Choi   95   90    92
Jung   85   84    88
Han    70   69    72
Yoon   88   85    87
Lim    92   91    95
Son    77   73    78
Jo     83   87    85
   name  kor  eng  math
0   Kim   90   88    91
1   Lee   80   79    83
2  Park   75   82    80
3  Choi   95   90    92
4  Jung   85   84    88
5   Han   70   69    72
6  Yoon   88   85    87
7   Lim   92   91    95
8   Son   77   73    78
9    Jo   83   87    85

<hr> 3. 조건 필터링과 정렬 (cars_mpg) <hr> 

- 3-1: mpg >= 30 인 행만 `q3_1_df`에.
- 3-2: manufacturer == 'audi' & year == 1999 인 행만 `q3_2_df`에.
- 3-3: horsepower 내림차순 정렬 결과를 `q3_3_sorted`에.
- 3-4: origin별 평균 mpg Series를 `q3_4_mean_mpg`에.
- 3-5: mpg 상위 5% 차량만 `q3_5_top5p`에.

In [86]:
# === [3] 조건 필터링과 정렬 ===
DATA_FILE = '../EXAM_DATA/cars_mpg.csv'
df = pd.read_csv(DATA_FILE)

# 3-1
q3_1_df = df[df['mpg']>=30]
display(q3_1_df)

# 3-2
mask1 = df['manufacturer'] == 'audi'
mask2 = df['year'] == 1999
q3_2_df = df[mask1 & mask2]
display(q3_2_df)

# 3-3
q3_3_sorted = df.sort_values('horsepower',ascending=False)
display(q3_3_sorted)

# 3-4
# q3_4_mean_mpg = df.groupby('origin')
# q3_4_mean_mpg.mean()

# 3-5
# 19개에서 상위 5% => 가장 큰 1개
q3_5_top5p = df.sort_values('mpg', ascending=False).iloc[0]
display(q3_5_top5p)

   manufacturer    model  year  mpg  horsepower  origin
1          audi       a3  2008   35         130  europe
4        toyota    camry  2015   30         160    asia
5        toyota  corolla  2017   32         150    asia
6         honda    civic  2014   34         140    asia
7         honda   accord  2019   36         145    asia
10         audi       a4  2007   31         150  europe
13        honda      fit  2013   37         118    asia
16       toyota    prius  2020   52         121    asia
17         audi       q5  2021   30         248  europe
18        honda  insight  2012   42          98    asia

  manufacturer model  year  mpg  horsepower  origin
0         audi    a1  1999   29         120  europe

   manufacturer    model  year  mpg  horsepower  origin
19          bmw       m3  2017   23         425  europe
11         ford  mustang  2016   21         300     usa
2          ford     f150  2005   22         250     usa
17         audi       q5  2021   30         248  europe
15         ford   escape  2011   24         210     usa
14          bmw       x3  2015   26         200  europe
3          ford    focus  2012   28         200     usa
9           bmw       x5  2020   25         190  europe
8           bmw     320i  2013   27         180  europe
12       toyota     rav4  2018   29         170    asia
4        toyota    camry  2015   30         160    asia
5        toyota  corolla  2017   32         150    asia
10         audi       a4  2007   31         150  europe
7         honda   accord  2019   36         145    asia
6         honda    civic  2014   34         140    asia
1          audi       a3  2008   35         130  europe
16       toyota    prius  2020   52         121    asia
0          audi       a1  1999   29         120  europe
13        honda      fit  2013   37         118    asia
18        honda  insight  2012   42          98    asia

manufacturer    toyota
model            prius
year              2020
mpg                 52
horsepower         121
origin            asia
Name: 16, dtype: object

<hr> 4. 결측치 처리 (titanic_simple) <hr> 

- 4-1: 컬럼별 결측치 개수 Series를 `q4_1_na`에.
- 4-2: age 결측치를 평균으로 채운 DataFrame을 `q4_2_filled`에.
- 4-3: 결측치가 1개라도 있는 행 제거 DataFrame을 `q4_3_dropna`에.
- 4-4: 결측치 여부(True/False) DataFrame을 `q4_4_isna`에.
- 4-5: 처리 전후 age 평균을 튜플로 `q4_5_before_after`에.

In [105]:
# === [4] 결측치 처리 ===
DATA_FILE = '../EXAM_DATA/titanic_simple.csv'
df = pd.read_csv(DATA_FILE)
display(df)

# 4-1
q4_1_na = ({'name', 'age', 'sex', 'survived'},
           {df['name'].isna().sum(), df['age'].isna().sum(), df['sex'].isna().sum(), df['survived'].isna().sum()})
q4_1_na = pd.DataFrame(q4_1_na)
display(q4_1_na)

# 4-2
q4_2_filled = df.fillna(df['age'].mean())
display(q4_2_filled)

# 4-3
q4_3_dropna = df.dropna()
display(q4_3_dropna)

# 4-4
q4_4_isna = df.isna()
display(q4_4_isna)

# 4-5
q4_5_before_after = (df['age'].mean() , q4_2_filled['age'].mean())
print(q4_5_before_after)

     name   age     sex  survived
0   Allen  22.0    male         0
1   Baker  38.0  female         1
2   Clark  26.0    male         1
3   Davis   NaN  female         1
4   Evans  35.0    male         0
5  Fisher  28.0  female         1
6   Green   NaN  female         0
7    Hill  19.0    male         0
8   Irwin  54.0    male         1
9   Jones   2.0  female         1

     0    1         2     3
0  sex  age  survived  name
1    0    2      None  None

     name   age     sex  survived
0   Allen  22.0    male         0
1   Baker  38.0  female         1
2   Clark  26.0    male         1
3   Davis  28.0  female         1
4   Evans  35.0    male         0
5  Fisher  28.0  female         1
6   Green  28.0  female         0
7    Hill  19.0    male         0
8   Irwin  54.0    male         1
9   Jones   2.0  female         1

     name   age     sex  survived
0   Allen  22.0    male         0
1   Baker  38.0  female         1
2   Clark  26.0    male         1
4   Evans  35.0    male         0
5  Fisher  28.0  female         1
7    Hill  19.0    male         0
8   Irwin  54.0    male         1
9   Jones   2.0  female         1

    name    age    sex  survived
0  False  False  False     False
1  False  False  False     False
2  False  False  False     False
3  False   True  False     False
4  False  False  False     False
5  False  False  False     False
6  False   True  False     False
7  False  False  False     False
8  False  False  False     False
9  False  False  False     False

(np.float64(28.0), np.float64(28.0))

<hr> 5. 그룹화와 집계 (employees) <hr> 

- 5-1: city 대신 employees 사용: department별 평균 salary Series를 `q5_1_dept_mean`에.
- 5-2: gender별 최대 salary Series를 `q5_2_gender_max`에.
- 5-3: (department, rank) 기준으로 salary 평균을 DataFrame `q5_3_group_mean`에.
- 5-4: salary에 대해 평균/중앙값/표준편차를 agg로 계산한 DataFrame을 `q5_4_agg`에.
- 5-5: department별 데이터 개수를 오름차순으로 정렬한 Series를 `q5_5_counts_sorted`에.

In [ ]:
# === [5] 그룹화와 집계 ===
DATA_FILE = '../EXAM_DATA/employees.csv'
df = pd.read_csv(DATA_FILE)
display(df)

# 5-1
q5_1_dept_mean = df.groupby('department')

# 5-2
q5_2_gender_max = ...
q5_3_group_mean = ...
q5_4_agg = ...
q5_5_counts_sorted = ...

    emp_id department rank gender  salary
0      101      Sales   Jr      M    3500
1      102      Sales   Sr      F    5200
2      103         HR   Jr      F    3300
3      104         HR   Sr      M    5400
4      105         IT   Jr      M    4000
5      106         IT   Sr      F    6100
6      107         IT  Mgr      M    8200
7      108    Finance   Jr      F    3900
8      109    Finance   Sr      M    6000
9      110      Sales  Mgr      F    9100
10     111         HR  Mgr      M    8700
11     112         IT   Sr      F    6500

<hr> 6. 피벗과 멀티인덱스 (sales_data) <hr>

- 6-1: city=행, gender=열, 값=sales 평균 pivot_table -> `q6_1_pivot`.
- 6-2: NaN을 0으로 채우고 int로 변환 -> `q6_2_filled`.
- 6-3: pivot에 연간 총합 컬럼 total 추가 -> `q6_3_total`.
- 6-4: sales_data를 melt -> id_vars=['city','gender'], var_name='metric', value_name='value' -> `q6_4_melt`.
- 6-5: long형에서 city별, gender별 평균 value DataFrame -> `q6_5_group`.

In [ ]:
# === [6] 피벗과 멀티인덱스 ===
q6_1_pivot = ...
q6_2_filled = ...
q6_3_total = ...
q6_4_melt = ...
q6_5_group = ...

<hr> 7. 병합과 결합 (user_info, user_score) <hr>

- 7-1: 두 DF를 id로 내부 조인 -> `q7_1_inner`.
- 7-2: 동일 컬럼명 충돌시 접미사 적용 예시: (`suffixes=('_L','_R')`)로 머지 -> `q7_2_suffix`.
- 7-3: user_score를 id 기준으로 평균 점수를 구한 DF -> `q7_3_score_mean`.
- 7-4: user_info와 7-3 결과를 left join -> `q7_4_left`.
- 7-5: user_info와 user_score를 행 방향 concat -> `q7_5_concat` (ignore_index=True).

In [ ]:
# === [7] 병합과 결합 ===
q7_1_inner = ...
q7_2_suffix = ...
q7_3_score_mean = ...
q7_4_left = ...
q7_5_concat = ...

<hr> 8. apply / lambda / 사용자 정의 함수 (apply_test) <hr>

- 8-1: score1의 제곱근 Series -> `q8_1_sqrt`.
- 8-2: 행 단위(axis=1)로 score1+score2 합 Series -> `q8_2_row_sum`.
- 8-3: name과 age를 결합한 full_name('Kim_25' 형식) Series -> `q8_3_fullname`.
- 8-4: age>=30 -> '성인' else '청년' Series -> `q8_4_age_group`.
- 8-5: 수치형 컬럼 평균을 반환하는 사용자 함수 `num_mean(df)` 정의하고, 결과를 `q8_5_num_mean`에.

In [ ]:
# === [8] apply / lambda / 사용자 정의 함수 ===
q8_1_sqrt = ...
q8_2_row_sum = ...
q8_3_fullname = ...
q8_4_age_group = ...
def num_mean(df):
    ...
q8_5_num_mean = ...

<hr> 9. 고급 응용 (analyze) <hr>

- 9-1: groupby city로 score 평균 Series -> `q9_1_city_score_mean`.
- 9-2: score 상위 10% 행만 DataFrame -> `q9_2_top10p`.
- 9-3: cut으로 age를 3구간으로 나누고 각 구간의 income 평균 Series -> `q9_3_bin_income_mean`.
- 9-4: 수치형 상관계수 DataFrame -> `q9_4_corr`.
- 9-5: 상관계수 절댓값이 가장 큰 쌍의 컬럼명 튜플 -> `q9_5_max_pair`.

In [ ]:
# === [9] 고급 응용 ===
q9_1_city_score_mean = ...
q9_2_top10p = ...
q9_3_bin_income_mean = ...
q9_4_corr = ...
q9_5_max_pair = ...

<hr> 10. 인덱스와 멀티인덱스 (multi_index) <hr> 

- 10-1: class, number를 인덱스로 설정한 DataFrame -> `q10_1_setidx`.
- 10-2: subject별 mid 평균 Series -> `q10_2_subj_mid_mean`.
- 10-3: 인덱스 초기화 DataFrame -> `q10_3_reset`.
- 10-4: 인덱스 이름을 ('반','번호')로 설정한 DataFrame -> `q10_4_named`.
- 10-5: (class, subject) 기준 mid 평균을 pivot_table로 wide 구성 -> `q10_5_pivot`.

In [ ]:
# === [10] 인덱스와 멀티인덱스 ===
q10_1_setidx = ...
q10_2_subj_mid_mean = ...
q10_3_reset = ...
q10_4_named = ...
q10_5_pivot = ...